---
kind: type
id: T:Autodesk.Revit.DB.ScheduleFieldId
source: html/e437cc01-b976-fe8a-225a-1a0024171fae.htm
---
# Autodesk.Revit.DB.ScheduleFieldId

The ScheduleFieldId object is used as a unique identification for a field in a schedule.

## Syntax (C#)
```csharp
public class ScheduleFieldId
```